import asyncio
import ebest
from common import *
from app_keys import appkey, appsecretkey # app_keys.py 파일에 appkey, appsecretkey 변수를 정의하고 사용하세요

########################################################################################
# g3190: 해외주식 API 마스터 조회
########################################################################################

async def sample(api):
    inputs = {
        'g3190InBlock': {
            'delaygb': 'R', # 지연구분
            'natcode': 'US', # 국가구분
            'exgubun': '2', # 거래소구분
            'readcnt': 0, # 조회갯수
            'cts_value': '', # 연속구분
        },
    }
    response = await api.request('g3190', inputs)
    if not response: return print(f"요청 실패: {api.last_message}")
    
    print(response)
    

async def main():
    api=ebest.OpenApi()
    if not await api.login(appkey, appsecretkey):
        return print(f'연결실패: {api.last_message}')
    await sample(api)
    await api.close()

if __name__ == '__main__':
    asyncio.run(main())


# Output:
'''
tr_cont='N', tr_cont_key='0'
g3190OutBlock
Field Count = 5
+-----------+------------------+
|    key    |      value       |
+-----------+------------------+
|  delaygb  |        R         |
|  natcode  |        US        |
|  exgubun  |        2         |
| cts_value | 0000000000000001 |
| rec_count |       4545       |
+-----------+------------------+
g3190OutBlock1
Row Count = 4545
+-----------+---------+--------+--------+---------+--------------------------------------------------------------+--------------------------------------------------------------+----------+--------------+------------+----------+-------------+--------------+-----------+---------+-------------+-------------+-----------+-------------+-------------+---------+----------+----------+-------+----------+-----------+------+------+------+-------+
| keysymbol | natcode | exchcd | symbol | seccode |                           korname                            |                           engname                            | currency |     isin     | floatpoint | indusury |    share    |  marketcap   |    par    | parcurr | bidlotsize2 | asklotsize2 |    clos   | listed_date | expire_date | suspend |   bymd   | sellonly | stamp | ticktype |    pcls   | vcmf | casf | posf | point |
+-----------+---------+--------+--------+---------+--------------------------------------------------------------+--------------------------------------------------------------+----------+--------------+------------+----------+-------------+--------------+-----------+---------+-------------+-------------+-----------+-------------+-------------+---------+----------+----------+-------+----------+-----------+------+------+------+-------+
|   82AACB  |    US   |   82   |  AACB  |  82AACB |                     아티우스 애퀴지션 2                      |                  ARTIUS II ACQUISITION INC                   |   USD    | KYG0509J1159 |     4      |   4530   |   22175000  |     575      |   0.0000  |         |      1      |      1      |   9.9800  |   20250407  |   00000000  |    N    | 20250508 |    0     |       |    1     |   9.9800  |      |      |      |   N   |
|  82AACBU  |    US   |   82   | AACBU  | 82AACBU |                   아티우스 애퀴지션 2 유닛                   |    ARTIUS II ACQUISITION INC UNIT 1 COM & RT (27/11/2029)    |   USD    | KYG0509J1076 |     4      |   4530   |   22175000  |     575      |   0.0000  |         |      1      |      1      |  10.1700  |   20250213  |   00000000  |    N    | 20250508 |    0     |       |    1     |  10.1700  |      |      |      |   N   |
|   82AACG  |    US   |   82   |  AACG  |  82AACG |                 ATA 크리에티비티 글로벌(ADR)                 |      ATA CREATIVITY GLOBAL SPON ADS EACH REP 2 ORD SHS       |   USD    | US00211V1061 |     4      |   3540   |   31624548  |    651522    |   0.0000  |         |      1      |      1      |   0.9799  |   20191017  |   00000000  |    N    | 20250508 |    0     |       |    1     |   0.9799  |      |      |      |   N   |
|   82AADR  |    US   |   82   |  AADR  |  82AADR |               ADVISORSHARES DORSEY WRIGHT ADR                |   ADVISORSHARES TRUST ADVISORSHARES DORSEY WRIGHT ADR ETF    |   USD    | US00768Y2063 |     4      |   9010   |    530000   |      0       |   0.0000  |         |      1      |      1      |  75.8634  |   20210603  |   00000000  |    N    | 20250508 |    0     |       |    1     |  75.8634  |      |      |      |   N   |
...
|   82ZYBT  |    US   |   82   |  ZYBT  |  82ZYBT |                  정예 바이오테크놀로지 홀딩                  |                ZHENGYE BIOTECHNOLOGY HLDG LTD                |   USD    | KYG989MS1016 |     4      |   4010   |   47391376  |     1101     |   0.0000  |         |      1      |      1      |  10.2500  |   20250107  |   00000000  |    N    | 20250508 |    0     |       |    1     |  10.2500  |      |      |      |   N   |
|   82ZYME  |    US   |   82   |  ZYME  |  82ZYME |                           자임웍스                           |                      ZYMEWORKS INC (US)                      |   USD    | US98985Y1082 |     4      |   4010   |   69576900  |  1023806000  |   0.0000  |         |      1      |      1      |  11.3200  |   20221216  |   00000000  |    N    | 20250508 |    0     |       |    1     |  11.3200  |      |      |      |   N   |
|   82ZYXI  |    US   |   82   |  ZYXI  |  82ZYXI |                            지넥스                            |                          ZYNEX INC                           |   USD    | US98986M1036 |     4      |   4020   |   30238900  |    30000     |   0.0000  |         |      1      |      1      |   2.1200  |   20190212  |   00000000  |    N    | 20250508 |    0     |       |    1     |   2.1200  |      |      |      |   N   |
|   82ZZZ   |    US   |   82   |  ZZZ   |  82ZZZ  |       CYBER HORNET S&P 500 AND BITCOIN 75/25 STRATEGY        |     ONEFUND TRUST CYBER HORNET S&P 500 & BITCOIN 75/25 S     |   USD    | US45407J4094 |     4      |   9010   |    200000   |      0       |   0.0000  |         |      1      |      1      |  26.7000  |   20231228  |   00000000  |    N    | 20250508 |    0     |       |    1     |  26.7000  |      |      |      |   N   |
+-----------+---------+--------+--------+---------+--------------------------------------------------------------+--------------------------------------------------------------+----------+--------------+------------+----------+-------------+--------------+-----------+---------+-------------+-------------+-----------+-------------+-------------+---------+----------+----------+-------+----------+-----------+------+------+------+-------+
rsp_cd
00000
rsp_msg
조회완료
'''
